using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AutoOpen
{
    class Class1
    {
        Dictionary<string, string> Area = new Dictionary<string, string>();
        public string read(string data)
        {
            //Console.WriteLine(Area[data]);
            if (Area.ContainsKey(data)==true)
            {
                Console.WriteLine(Area[data]);
                return Area[data];
            }
            else
            {
                Console.WriteLine(Area[data]);
                return "Not Found";
            }
            
        }
        public void CreateDictionary()
        {
            
            Area.Add(@"T100 (中正區)-011","172.19.100.5");
            Area.Add(@"T100 (中正區)-021","172.19.100.9");
            Area.Add(@"T100 (中正區)-031","172.19.100.13");
            Area.Add(@"T100 (中正區)-041","172.19.100.17");
            Area.Add(@"T100 (中正區)-061","172.19.100.25");
            Area.Add(@"T100 (中正區)-071","172.19.100.29");
            Area.Add(@"T103 (大同區)-001","172.19.103.1");
            Area.Add(@"T103 (大同區)-011","172.19.103.5");
            Area.Add(@"T103 (大同區)-021","172.19.103.9");
            Area.Add(@"T103 (大同區)-031","172.19.103.13)");
            Area.Add(@"T103 (大同區)-041","172.19.103.17");
            Area.Add(@"T103 (大同區)-051","172.19.103.21");
            Area.Add(@"T104 (中山區)-001","172.19.104.1");
            Area.Add(@"T104 (中山區)-011","172.19.114.49)");
            Area.Add(@"T104 (中山區)-031","172.19.104.13");
            Area.Add(@"T104 (中山區)-041","172.19.104.17");
            Area.Add(@"T104 (中山區)-051","172.19.104.21");
            Area.Add(@"T104 (中山區)-061","172.19.114.53");
            Area.Add(@"T104 (中山區)-071","172.19.104.29");
            Area.Add(@"T104 (中山區)-081","172.19.104.33");
            Area.Add(@"T105 (松山區)-001","172.19.105.1");
            Area.Add(@"T105 (松山區)-011","172.19.105.5");
            Area.Add(@"T105 (松山區)-021","172.19.105.9");
            Area.Add(@"T105 (松山區)-031", "172.19.105.13");
            Area.Add(@"T105 (松山區)-041","172.19.105.17");
            Area.Add(@"T105 (松山區)-051","172.19.105.21");
            Area.Add(@"T105 (松山區)-061","172.19.105.25");
            Area.Add(@"T105 (松山區)-071","172.19.105.29");
            Area.Add(@"T105 (松山區)-081","172.19.105.33");
            Area.Add(@"T106 (大安區)-001","172.19.106.1");
            Area.Add(@"T106 (大安區)-011","172.19.106.5");
            Area.Add(@"T106 (大安區)-021","172.19.106.9");
            Area.Add(@"T106 (大安區)-031","172.19.106.13");
            Area.Add(@"T106 (大安區)-041","172.19.106.17");
            Area.Add(@"T106 (大安區)-051","172.19.106.21");
            Area.Add(@"T106 (大安區)-061","172.19.106.25");
            Area.Add(@"T106 (大安區)-071","172.19.106.29");
            Area.Add(@"T106 (大安區)-081","172.19.106.33");
            Area.Add(@"T106 (大安區)-101","172.19.106.41");
            Area.Add(@"T106 (大安區)-121","172.19.106.49");
            Area.Add(@"T108 (萬華區)-011","172.19.108.5");
            Area.Add(@"T108 (萬華區)-021","172.19.108.9");
            Area.Add(@"T108 (萬華區)-031","172.19.108.13");
            Area.Add(@"T108 (萬華區)-041","172.19.108.17");
            Area.Add(@"T108 (萬華區)-051","172.19.108.21");
            Area.Add(@"T108 (萬華區)-061","172.19.108.25");
            Area.Add(@"T110 (信義區)-001","172.19.110.1");
            Area.Add(@"T110 (信義區)-021","172.19.110.9");
            Area.Add(@"T110 (信義區)-031","172.19.110.13");
            Area.Add(@"T110 (信義區)-041","172.19.110.17");
            Area.Add(@"T110 (信義區)-051","172.19.110.21");
            Area.Add(@"T110 (信義區)-061","172.19.110.25");
            Area.Add(@"T110 (信義區)-081","172.19.110.33");
            Area.Add(@"T110 (信義區)-091","172.19.110.37");
            Area.Add(@"T110 (信義區)-101","172.19.110.41");
            Area.Add(@"T111 (士林區)-001","172.19.111.1");
            Area.Add(@"T111 (士林區)-011","172.19.111.5");
            Area.Add(@"T111 (士林區)-021","172.19.111.9");
            Area.Add(@"T111 (士林區)-031","172.19.111.13)");
            Area.Add(@"T111 (士林區)-041","172.19.111.17");
            Area.Add(@"T111 (士林區)-061","172.19.111.25");
            Area.Add(@"T111 (士林區)-071","172.19.111.29");
            Area.Add(@"T111 (士林區)-081","172.19.111.33");
            Area.Add(@"T111 (士林區)-091","172.19.111.37");
            Area.Add(@"T111 (士林區)-101","172.19.111.41");
            Area.Add(@"T111 (士林區)-111","172.19.111.45");
            Area.Add(@"T112 (北投區)-001","172.19.112.1");
            Area.Add(@"T112 (北投區)-011","172.19.112.5");
            Area.Add(@"T112 (北投區)-031","172.19.112.13");
            Area.Add(@"T112 (北投區)-041","172.19.112.17");
            Area.Add(@"T112 (北投區)-051","172.19.112.21");
            Area.Add(@"T112 (北投區)-061","172.19.112.25");
            Area.Add(@"T112 (北投區)-071","172.19.112.29");
            Area.Add(@"T112 (北投區)-081","172.19.112.33");
            Area.Add(@"T114 (內湖區)-001","172.19.114.1");
            Area.Add(@"T114 (內湖區)-002","172.19.114.2");
            Area.Add(@"T114 (內湖區)-004","172.19.114.4");
            Area.Add(@"T114 (內湖區)-011","172.19.114.5");
            Area.Add(@"T114 (內湖區)-021","172.19.114.9");
            Area.Add(@"T114 (內湖區)-031","172.19.114.13)");
            Area.Add(@"T114 (內湖區)-041","172.19.114.17");
            Area.Add(@"T114 (內湖區)-051","172.19.114.21");
            Area.Add(@"T114 (內湖區)-061","172.19.114.25");
            Area.Add(@"T114 (內湖區)-071","172.19.114.29");
            Area.Add(@"T114 (內湖區)-081","172.19.114.33");
            Area.Add(@"T114 (內湖區)-091","172.19.114.37");
            Area.Add(@"T114 (內湖區)-101","172.19.114.41");
            Area.Add(@"T115 (南港區)-011","172.19.115.5");
            Area.Add(@"T115 (南港區)-021","172.19.115.9");
            Area.Add(@"T115 (南港區)-031","172.19.115.13");
            Area.Add(@"T115 (南港區)-041","172.19.115.17");
            Area.Add(@"T115 (南港區)-051","172.19.115.21");
            Area.Add(@"T115 (南港區)-061","172.19.115.25");
            Area.Add(@"T116 (文山區)-011","172.19.116.5");
            Area.Add(@"T116 (文山區)-021","172.19.116.9");
            Area.Add(@"T116 (文山區)-031","172.19.116.13");
            Area.Add(@"T116 (文山區)-041","172.19.116.17");
            Area.Add(@"T116 (文山區)-051","172.19.116.21");
            Area.Add(@"T116 (文山區)-061","172.19.116.25");
            Area.Add(@"T116 (文山區)-071","172.19.116.29");
            Area.Add(@"T116 (文山區)-081","172.19.116.33");
            Area.Add(@"T116 (文山區)-091","172.19.116.37");
            Area.Add(@"T116 (文山區)-101","172.19.116.41");

        }
    }
}
